[
  {
    "id": "recipe1",
    "title": ["Chilli", "Bowl"],
    "image": "image/lunchpic1.png",
    "ingredients": [
      { "name": "Ground beef", "quantity": 150, "unit": "g" },
      { "name": "Crushed tomatoes", "quantity": 0.5, "unit": "cup" },
      { "name": "Kidney beans", "quantity": 0.5, "unit": "cup" },
      { "name": "Onion", "quantity": 0.25, "unit": "diced" },
      { "name": "Garlic", "quantity": 1, "unit": "clove" },
      { "name": "Chilli Powder", "quantity": 1, "unit": "tsp" }
    ],
    "descriptiontitle": ["Chili bowls are bold, cozy, and always hit the spot"],
    "description": [
      "They’re packed with protein, omega-3s (hello, brain boost), and all the good fats that keep your skin glowing. Plus, they’re usually loaded with veggies and rice or quinoa, so it’s like a full-on balanced meal that actually slaps. Tasty and good for you? Big win."
    ],
    "steps1": [
      "1. Sauté the base: Heat oil in a pan. Sauté onion and garlic until soft.",
      "2. Cook the meat: Add ground beef (or plant-based meat) and brown it. Break it up with a spoon until fully cooked.",
      "3. Add the flavor: Stir in chili powder, cumin, salt, and pepper (to taste). Let it bloom for a minute."
    ],
    "steps2": [
      "5. Add tomatoes & beans: Pour in crushed tomatoes, beans, and corn (optional, if using). Simmer for 10–15 minutes. Add water/broth if it gets too thick.",
      "6. Taste & top: Adjust seasoning. Serve in a bowl with your favorite toppings. (Optional toppings – sour cream, cheese, avocado, green onion, tortilla chips)"
    ]
  },
  {
    "id": "recipe2",
    "title": ["Broccoli Fried", "Rice"],
    "image": "image/lunchpic13.png",
    "ingredients": [
      { "name": "Cooked rice", "quantity": 1, "unit": "cups" },
      { "name": "Broccoli", "quantity": 1, "unit": "cups" },
      { "name": "Garlic", "quantity": 1, "unit": "cloves" },
      { "name": "Green onion", "quantity": 1, "unit": "" },
      { "name": "Soy sauce", "quantity": 1, "unit": "tbsp" },
      { "name": "Sesame oil", "quantity": 1, "unit": "tbsp" }
    ],
    "descriptiontitle": [
      "Broccoli Fried Rice is the low-effort, high-reward hero"
    ],
    "description": [
      "They’re packed with protein, fiber, and flavor—and they’re endlessly customizable. Whether you like it mild or fiery, meaty or veggie, chili is that one-pot wonder you’ll want on repeat. Bonus: leftovers taste even better."
    ],
    "steps1": [
      "1. Prep your broccoli: If using fresh broccoli (fresh or frozen), steam or microwave it for 1–2 minutes until just tender. If frozen, thaw it first.",
      "2.Scramble the egg (if using): Heat a bit of oil in a pan or wok. Crack in the egg, scramble it quickly, and set aside.",
      "3. Stir-fry the veggies: Add more oil, then sauté garlic and green onion (or use regular onion) for about 30 seconds. Add broccoli and stir-fry for 2–3 minutes."
    ],
    "steps2": [
      "5.Add the rice (cold, day-old rice works best): Toss in your cold rice. Use a spatula to break up any clumps and stir-fry everything together until hot.",
      "6. Season & finish: Add soy sauce, salt, pepper, and scrambled egg back in. Stir well. Drizzle with a little sesame oil at the end for that classic fried rice finish. (Optional add-ins: chili flakes, ginger, sesame seeds, tofu, chicken, etc.)"
    ]
  },
  {
    "id": "recipe3",
    "title": ["Beef", "Stew"],
    "image": "image/lunchpic14.png",
    "ingredients": [
      { "name": "Beef stew meat", "quantity": 200, "unit": "g" },
      { "name": "Shallot", "quantity": 1, "unit": "" },
      { "name": "Garlic", "quantity": 1, "unit": "clove" },
      { "name": "Baby potatoes", "quantity": 7, "unit": "halved" },
      { "name": "Beef broth", "quantity": 1, "unit": "cup" },
      { "name": "Tomato paste", "quantity": 1, "unit": "tbsp" }
    ],
    "descriptiontitle": ["Beef Stew is the ultimate one-pot comfort fix"],
    "description": [
      "It’s warm, filling, and packed with tender beef, soft veggies, and a rich, savory broth. Total hug-in-a-bowl energy. Plus, you can speed it up with smaller beef cuts or pressure cooker magic—and still get that slow-cooked flavor."
    ],
    "steps1": [
      "1. Sear the beef: In a pot, melt butter over medium-high heat. Add beef cubes and brown them on all sides. Remove and set aside.",
      "2. Sauté the aromatics: In the same pot, lower heat and sauté shallots and garlic until fragrant and soft.",
      "3. Simmer: Add tomato paste and stir it in. Return beef to the pot, add potatoes, herbs, and broth. Bring to a boil, then reduce to a gentle simmer."
    ],
    "steps2": [
      "4. Cook until tender: Cover and let it simmer for 40–50 minutes, or until the beef is tender and potatoes are cooked through.",
      "5. Final touch: Season with salt and pepper to taste. Discard bay leaf and herb stems. Garnish generously with fresh parsley."
    ]
  },
  {
    "id": "recipe4",
    "title": ["Lentil", "Stew"],
    "image": "image/lunchpic3.png",
    "ingredients": [
      { "name": "Cooked lentils", "quantity": 0.75, "unit": "cups" },
      { "name": "medium Potato", "quantity": 0.5, "unit": "" },
      { "name": "small Carrot", "quantity": 1, "unit": "" },
      { "name": "medium Onion", "quantity": 0.25, "unit": "" },
      { "name": "Crushed tomatoes", "quantity": 0.5, "unit": "cup" },
      { "name": "Garlic", "quantity": 1, "unit": "clove" }
    ],
    "descriptiontitle": ["Lentil Stew is comfort in a bowl"],
    "description": [
      "It’s warm, filling, and packed with plant-based goodness. With earthy lentils, chunky veggies, and a rich tomato-spiced broth, this stew is your go-to for cozy days, meal prep wins, or when you just want something that hits like a hug."
    ],
    "steps1": [
      "1. Sauté the aromatics: Heat olive oil in a pot over medium heat. Add finely chopped onion and minced garlic, sauté until soft and fragrant (about 2–3 minutes).",
      "2. Add veggies & spices: Toss in the diced carrot and potato. Sprinkle in paprika, cumin, salt, and pepper (to taste). Stir and let cook for a few minutes.",
      "3. Add liquids & lentils: Pour in the crushed tomatoes and veggie broth (adjust as needed). Stir in the lentils (brown or green work great). Bring to a boil, then lower to a simmer."
    ],
    "steps2": [
      "5. Simmer until tender: Let it cook for 15–20 minutes, or until potatoes and carrots are fork-tender. Add more broth if it gets too thick.",
      "6. Stir in greens (optional): Toss in a handful of spinach or kale at the end and let it wilt.",
      "7. Serve it up: Pour into a bowl, top with parsley (optional), and add a scoop of barley or rice if you’re feeling it"
    ]
  },
  {
    "id": "recipe5",
    "title": ["Carbonara"],
    "image": "image/lunchpic4.png",
    "ingredients": [
      { "name": "Spaghetti", "quantity": 75, "unit": "g" },
      { "name": "Pancetta or bacon", "quantity": 50, "unit": "g" },
      { "name": "large Egg", "quantity": 1, "unit": "" },
      { "name": "Heavy Cream", "quantity": 0.5, "unit": "cup" },
      { "name": "Parmesan", "quantity": 0.25, "unit": "cup" },
      { "name": "Garlic", "quantity": 1, "unit": "clove" }
    ],
    "descriptiontitle": ["Carbonara is the cheat code to comfort"],
    "description": [
      "It’s creamy (without cream), smoky, salty, and ridiculously satisfying—all made in one pan, in under 20 minutes. With just a few pantry staples and zero fluff, carbonara proves that simple really can be spectacular. Fork-twirling bliss? Confirmed."
    ],
    "steps1": [
      "1. Cook the pasta: Boil spaghetti in salted water until al dente. Reserve a bit of pasta water before draining. (About 2–3)",
      "2. Crisp the bacon: While pasta cooks, fry the diced pancetta or bacon in a skillet over medium heat until crispy. Add the smashed garlic (optional) for a quick sizzle if using, then remove it.",
      "3. Make the sauce base: In a bowl, whisk together the egg, grated cheese, and lots of black pepper."
    ],
    "steps2": [
      "4. Combine off heat: Once the pasta is cooked and drained, immediately toss it into the pan with the bacon (off the heat). Quickly stir in the egg-cheese mix, adding a splash of hot pasta water to create a silky sauce.",
      "5. Stir until creamy: Keep tossing until everything is glossy and coated. The heat from the pasta cooks the egg gently, turning it into a dreamy sauce.",
      "6. Serve hot: Top with extra cheese and black pepper. Eat immediately and smile."
    ]
  },
  {
    "id": "recipe6",
    "title": ["Tomato", "Pasta"],
    "image": "image/lunchpic12.png",
    "ingredients": [
      { "name": "Pasta", "quantity": 75, "unit": "g" },
      { "name": "Garlic", "quantity": 1, "unit": "clove" },
      {
        "name": "Crushed Tomatoes",
        "quantity": 0.5,
        "unit": "cup"
      },
      { "name": "Olive oil", "quantity": 1, "unit": "tsp" },
      { "name": "Italian Seasoning", "quantity": 1, "unit": "tsp" }
    ],
    "descriptiontitle": ["Tomato Pasta is the OG weeknight hero"],
    "description": [
      "It’s simple, saucy, and totally unfussy—but still manages to taste like you put in way more effort than you did. With just a handful of ingredients and one pot, it brings that cozy, classic Italian comfort without the fuss. Fast, flavorful, and always reliable."
    ],
    "steps1": [
      "1. Cook the pasta (spaghetti, penne, fusilli—whatever you love): Boil in salted water until al dente. Reserve 2–3 tablespoons of the pasta water before draining.",
      "2. Make the sauce: While pasta cooks, heat olive oil in a pan over medium heat. Add minced garlic (and chili flakes if using), and sauté for about 30 seconds — don’t let it burn.",
      "3. Add the tomatoes: Pour in the crushed tomatoes or passata. Stir, season with salt and pepper, and let it simmer for 5–10 minutes to thicken slightly."
    ],
    "steps2": [
      "4. Combine & finish: Add the drained pasta to the sauce, along with a splash of pasta water. Toss everything together until the sauce coats the pasta beautifully.",
      "5. Serve & top it off: Plate it up, sprinkle with cheese and fresh herbs (Fresh basil or parsley) if you’ve got ‘em, and enjoy!"
    ]
  }
]
